<script setup lang="ts"></script>

<template>
  <div id="agreement-view" class="page-box">
    <h1>TOGAPhotos用户协议</h1>
    <p>
      欢迎您使用TOGAPhotos（以下简称“本网站”）提供的服务。
      请仔细阅读以下用户协议（以下简称“本协议”），一旦您注册成为本网站的用户，即表示您已阅读、理解并同意受本协议的各项条款和条件的约束。
    </p>
    <h2>一、用户注册</h2>
    <div>
      <strong>账户安全</strong>
      <ul>
        <li>用户有责任保护其账户信息的安全，不得将账户借予他人使用。</li>
        <li>因用户自身原因导致的账户被盗或信息泄露，本网站不承担责任。</li>
      </ul>
    </div>
    <h2>二、用户行为约束</h2>
    <div>
      <strong>照片上传</strong><br />
      <ul>
        <li>
          用户上传的照片不得侵犯他人的著作权、肖像权、名誉权或其他合法权利。
        </li>
        <li>
          用户不得上传含有暴力、色情、诽谤、恐吓、违法或其他不当内容的照片。
        </li>
        <li>本网站有权根据自身判断，删除任何违反本协议或不当的照片。</li>
      </ul>
      <strong>信息发布</strong>
      <ul>
        <li>
          用户不得通过任何形式在本网站发布含有暴力、色情、诽谤、恐吓、违法或其他不当内容的信息。
        </li>
        <li>
          用户不得利用本网站发布任何形式的广告或商业信息，除非获得本网站的明确许可。
        </li>
        <li>本网站有权根据自身判断，删除任何违反本协议或不当的信息。</li>
      </ul>
    </div>
    <h2>三、隐私政策</h2>
    <div>
      <strong>信息收集</strong>
      <ul>
        <li>本网站将收集用户在注册及使用服务过程中提供的个人信息。</li>
        <li>本网站会采取合理的技术措施，保护用户的个人信息安全。</li>
      </ul>

      <strong>信息使用</strong>
      <ul>
        <li>本网站仅在提供服务和改进用户体验的目的下使用用户的个人信息。</li>
        <li>
          非经用户同意，本网站不会将用户的个人信息透露给第三方，除非法律法规另有规定。
        </li>
      </ul>
      <strong>信息删除</strong>
      <ul>
        <li>用户可随时删除自己上传的照片或注销账户。</li>
        <li>
          在违反本协议或应监管机构要求的情况下，本网站有权删除用户的照片和账户信息。
        </li>
      </ul>
    </div>
    <h2>四、知识产权</h2>
    <div>
      <strong>用户内容</strong>
      <ul>
        <li>用户在本网站上传的照片版权归用户所有。</li>
        <li>本网站严格根据用户在个人设置页面的选择使用用户的图片。</li>
        <li>本网站和用户另行达成使用协议的不受本条款约束</li>
      </ul>

      <strong>网站内容</strong>
      <ul>
        <li>
          本网站上的所有内容（包括但不限于文字、图片、视频、图形、标志、按钮图标等）的知识产权归本网站或相关权利人所有，受法律保护。
        </li>
        <li>未经本网站或相关权利人许可，用户不得以任何形式使用这些内容。</li>
      </ul>
    </div>
    <h2>五、免责声明</h2>
    <div>
      <strong>服务中断或故障</strong>
      <ul>
        <li>
          本网站不保证服务的持续、无故障提供，对因不可抗力或非本网站原因导致的服务中断或故障不承担责任。
        </li>
      </ul>
      <strong>用户内容</strong>
      <ul>
        <li>
          用户对其上传的内容承担全部责任，本网站对用户上传的内容不负任何法律责任。
        </li>
      </ul>
    </div>
    <h2>六、协议修改</h2>
    <div>
      <strong>修改协议</strong>
      <ul>
        <li>
          本网站保留在任何时候对本协议进行修改的权利，并在修改协议前以合适的方式告知用户。
        </li>
        <li>用户继续使用本网站服务，即视为接受修改后的协议。</li>
      </ul>
    </div>
  </div>
</template>

<style scoped>
#agreement-view {
  padding: 0 2em;
}
h1,
h2,
h3,
h4,
h5 {
  margin: 1em 0 0.4em 0;
}
ul {
  margin: 0 0 12px 0;
}
</style>
